"use client"

import { Wrapper,AdvWrapper, Text, TextWrapper, SubText } from "./ExcursionsStyle";

import Gaz from "../../../../public/images/gaz.jpg"

import Card from "./ExcursionsCard/ExcursionsCard";

const Excursions = () => {
  return (
    <AdvWrapper>
      <TextWrapper>
       <Text>Выбери свою экскурсию!</Text>
       <SubText>На этой странице представлены все экскурсии, которые вы можете
        посетить с нами.
       </SubText>
      </TextWrapper>
    <Wrapper>
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      <Card
      image={Gaz}
      title="Автомобильный завод"
      description="Горьковский автомобильный завод (ГАЗ) – крупнейшее предприятие российского автомобилестроения. Автозавод вступил в строй действующих 1 января 1932 года, а 29 января с конвейера сошел первый грузовик – «полуторка» ГАЗ-АА"
      />
      
    </Wrapper>
    </AdvWrapper>
  )
};

export default Excursions;
